//
//  QuoteBrain.swift
//  RandomWiseSaying
//
//  Created by 순진이 on 2022/03/15.
//

import Foundation
import UIKit

struct QuoteBrain {
    let quoteArray = [
        Quote(quote: "명성을 쌓는 데는 20년이란 세월이 걸리며, 명성을 무너뜨리는 데는 채 5분도 걸리지 않는다. 그걸 명심한다면, 당신의 행동이 달라질 것이다.", person: "워런 버핏"),
        Quote(quote: "바보의 뇌는 철학을 바보짓으로, 과학을 미신으로, 예술을 규칙으로 바꾼다. 그것이 대학교육이다.", person: "조지 버나드 쇼"),
        Quote(quote: "강력한 이유는 강력한 행동을 낳는다.", person: "윌리엄 셰익스피어"),
        Quote(quote: "더 많이 준다고 아이를 망치는 게 아니다. 충돌을 피하려고 더 많이 주면 아이를 망친다.", person: "존 그레이"),
        Quote(quote: "교육은 일종의 계속되는 대화이고, 그 대화는 세상일이 보통 그렇듯 여러 가지 관점이 있음을 인정한다.", person: "로버트 허친스"),
        Quote(quote: "중요한 것은 학습을 중단하지 않고, 도전을 즐기고, 애매모호함을 받아들이는 것이다. 종국에는 확실한 해답은 없기 마련이다.", person: "마티나 호너"),
        Quote(quote: "나는 믿음을 존중하지만 우리를 가르치는 것은 의구심이다.", person: "윌슨 미즈너"),
        Quote(quote: "어떤 분야에서든 유능해지고 성공하기 위해선 세 가지가 필요하다. 타고난 천성과 공부 그리고 부단한 노력이 그것이다.", person: "헨리 워드 비처"),
        Quote(quote: "아버지들은 자신이 대학을 나왔기 때문에, 혹은 자신이 대학을 나오지 않았기 때문에 아들을 대학에 보낸다.", person: "L.L.헨더슨"),
        Quote(quote: "자신을 화나게 했던 행동을 다른 이에게 행하지 말라.", person: "소크라테스"),
        Quote(quote: "자유와 정의 다음으로 중요한 것은 대중 교육인데, 대중 교육 없이는 자유도 정의도 영원히 유지될 수 없다.", person: "제임스 A.가필드"),
        Quote(quote: "아이들이 답이 있는 질문을 하기 시작하면 그들이 성장하고 있음을 알 수 있다.", person: "존 J. 플롬프"),
        Quote(quote: "제자가 계속 제자로만 남는다면 스승에 대한 고약한 보답이다.", person: "프레드리히 니체"),
    ]
    
}
